In [1]:
import pandas as pd

In [2]:
file = 'https://raw.githubusercontent.com/alamhanz/pandas_journey/main/mydata/food_delivery_datasets.csv' # merujuk link data csv
dataset = pd.read_csv(file, sep=',') #membuka data csv
dataset.head()

,order_id,voucher_amount,date_time,eta_seconds,food_price,cust_id,rating,delivery_fee,resto_id,status,random_id
0,FOOD-10455,0,2018-08-12T20:35:08.001006,1800,18900,1089034,5.0,4000,742638033,Completed,0.511149
1,FOOD-10985,0,2018-09-23T17:44:12.243273,2173,149000,180146,5.0,11000,742767245,Completed,0.832936
2,FOOD-10911,0,2018-09-19T18:08:09.387991,1418,43800,366528,NaN,9000,742618303,Completed,0.828026
3,FOOD-10932,0,2018-09-21T01:24:35.272499,1903,39900,511038,5.0,14000,742541172,Completed,0.239377
4,FOOD-10961,0,2018-09-22T17:57:45.523161,1716,77700,1220358,NaN,4000,742604875,Completed,0.995587

In [52]:
#ID CUSTOMER DENGAN ORDER TERBANYAK

In [44]:
data1=dataset[['date_time', 'cust_id']] #menampilkan data yang diperlukan
data1.head()

                    date_time  cust_id
0  2018-08-12T20:35:08.001006  1089034
1  2018-09-23T17:44:12.243273   180146
2  2018-09-19T18:08:09.387991   366528
3  2018-09-21T01:24:35.272499   511038
4  2018-09-22T17:57:45.523161  1220358

In [45]:
data1.isna().sum() #menghitung missing value

date_time    0
cust_id      0
dtype: int64

In [46]:
df_cust_id = data1[data1['cust_id']>0] #filter data customer 
df_cust_id.head()

                    date_time  cust_id
0  2018-08-12T20:35:08.001006  1089034
1  2018-09-23T17:44:12.243273   180146
2  2018-09-19T18:08:09.387991   366528
3  2018-09-21T01:24:35.272499   511038
4  2018-09-22T17:57:45.523161  1220358

In [48]:
df_cust_id['cust_id'].mode() #mencari customer dengan order terbanyak

0    366528
dtype: int64

In [53]:
#Menghitung Biaya Kirim per waktu pengiriman

In [54]:
data2=dataset[['eta_seconds', 'delivery_fee']] #menampilkan data yang diperlukan
data2.head()

   eta_seconds  delivery_fee
0         1800          4000
1         2173         11000
2         1418          9000
3         1903         14000
4         1716          4000

In [55]:
data2.isna().sum() #menghitung missing value

eta_seconds     0
delivery_fee    0
dtype: int64

In [57]:
data2.describe() #statistika deskriptif data

       eta_seconds  delivery_fee
count  1076.000000   1076.000000
mean   1632.289033   9252.788104
std     948.628732   6723.595497
min       2.000000      0.000000
25%    1074.750000   4000.000000
50%    1605.500000   9000.000000
75%    2151.000000  12000.000000
max    6082.000000  44000.000000

In [60]:
mean_eta_seconds=data2['eta_seconds'].mean() #menghitung rata rata waktu pengiriman

In [62]:
mean_delivery_fee=data2['delivery_fee'].mean() #menghitung rata rata ongkos kirim

In [64]:
mean_delivery_fee/mean_eta_seconds

5.668596623780206